### Terraform Plan: `prod`

<details><summary>Show plan</summary>

```
data.terraform_remote_state.shared: Reading...
module.env.random_password.db_password: Refreshing state... [id=none]
data.terraform_remote_state.shared: Read complete after 0s
module.env.google_vpc_access_connector.connector: Refreshing state... [id=projects/pocket-av/locations/us-central1/connectors/run-connector-prod]
module.env.google_service_account.keycache_server: Refreshing state... [id=projects/pocket-av/serviceAccounts/keycache-server-prod@pocket-av.iam.gserviceaccount.com]
module.env.google_compute_global_address.web_ipv4: Refreshing state... [id=projects/pocket-av/global/addresses/pocket-av-web-ip-prod]
module.env.google_storage_bucket.recordings: Refreshing state... [id=pocket-av-recordings-prod]
module.env.google_compute_managed_ssl_certificate.api: Refreshing state... [id=projects/pocket-av/global/sslCertificates/pocket-av-api-cert-prod]
module.env.google_compute_url_map.web_http_redirect: Refreshing state... [id=projects/pocket-av/global/urlMaps/pocket-av-web-http-redirect-prod]
module.env.google_sql_database_instance.main: Refreshing state... [id=pocket-av-db-prod]
module.env.google_storage_bucket.web: Refreshing state... [id=app.pocket-rad.io]
module.env.google_compute_managed_ssl_certificate.web: Refreshing state... [id=projects/pocket-av/global/sslCertificates/pocket-av-web-cert-prod]
module.env.google_compute_global_address.api_ipv4: Refreshing state... [id=projects/pocket-av/global/addresses/pocket-av-api-ip-prod]
module.env.google_secret_manager_secret.db_password: Refreshing state... [id=projects/pocket-av/secrets/db-password-prod]
module.env.google_compute_url_map.api_http_redirect: Refreshing state... [id=projects/pocket-av/global/urlMaps/pocket-av-api-http-redirect-prod]
module.env.google_storage_bucket_iam_member.web_deployer: Refreshing state... [id=b/app.pocket-rad.io/roles/storage.objectAdmin/serviceAccount:github-actions@pocket-av.iam.gserviceaccount.com]
module.env.google_storage_bucket_iam_member.web_public: Refreshing state... [id=b/app.pocket-rad.io/roles/storage.objectViewer/allUsers]
module.env.google_compute_backend_bucket.web: Refreshing state... [id=projects/pocket-av/global/backendBuckets/pocket-av-web-backend-prod]
module.env.google_sql_user.app: Refreshing state... [id=ssdb//pocket-av-db-prod]
module.env.google_sql_database.keycache: Refreshing state... [id=projects/pocket-av/instances/pocket-av-db-prod/databases/keycache]
module.env.google_service_account_iam_member.keycache_server_token_creator: Refreshing state... [id=projects/pocket-av/serviceAccounts/keycache-server-prod@pocket-av.iam.gserviceaccount.com/roles/iam.serviceAccountTokenCreator/serviceAccount:keycache-server-prod@pocket-av.iam.gserviceaccount.com]
module.env.google_storage_bucket_iam_member.recordings_admin: Refreshing state... [id=b/pocket-av-recordings-prod/roles/storage.objectAdmin/serviceAccount:keycache-server-prod@pocket-av.iam.gserviceaccount.com]
module.env.google_project_iam_member.keycache_server_roles["roles/secretmanager.secretAccessor"]: Refreshing state... [id=pocket-av/roles/secretmanager.secretAccessor/serviceAccount:keycache-server-prod@pocket-av.iam.gserviceaccount.com]
module.env.google_project_iam_member.keycache_server_roles["roles/cloudsql.client"]: Refreshing state... [id=pocket-av/roles/cloudsql.client/serviceAccount:keycache-server-prod@pocket-av.iam.gserviceaccount.com]
module.env.google_secret_manager_secret_version.db_password: Refreshing state... [id=projects/148242134126/secrets/db-password-prod/versions/1]
module.env.google_dns_record_set.web_a: Refreshing state... [id=projects/pocket-av/managedZones/pocket-rad-io/rrsets/app.pocket-rad.io./A]
module.env.google_compute_target_http_proxy.web: Refreshing state... [id=projects/pocket-av/global/targetHttpProxies/pocket-av-web-http-prod]
module.env.google_dns_record_set.api_a: Refreshing state... [id=projects/pocket-av/managedZones/pocket-rad-io/rrsets/api.pocket-rad.io./A]
module.env.google_compute_target_http_proxy.api: Refreshing state... [id=projects/pocket-av/global/targetHttpProxies/pocket-av-api-http-prod]
module.env.google_cloud_run_v2_service.keycache_server: Refreshing state... [id=projects/pocket-av/locations/us-central1/services/keycache-server-prod]
module.env.google_compute_url_map.web: Refreshing state... [id=projects/pocket-av/global/urlMaps/pocket-av-web-prod]
module.env.google_compute_global_forwarding_rule.api_http: Refreshing state... [id=projects/pocket-av/global/forwardingRules/pocket-av-api-http-fwd-prod]
module.env.google_cloud_run_v2_service_iam_member.public: Refreshing state... [id=projects/pocket-av/locations/us-central1/services/keycache-server-prod/roles/run.invoker/allUsers]
module.env.google_compute_region_network_endpoint_group.api_neg: Refreshing state... [id=projects/pocket-av/regions/us-central1/networkEndpointGroups/pocket-av-api-neg-prod]
module.env.google_compute_target_https_proxy.web: Refreshing state... [id=projects/pocket-av/global/targetHttpsProxies/pocket-av-web-https-prod]
module.env.google_compute_global_forwarding_rule.web_http: Refreshing state... [id=projects/pocket-av/global/forwardingRules/pocket-av-web-http-fwd-prod]
module.env.google_compute_backend_service.api: Refreshing state... [id=projects/pocket-av/global/backendServices/pocket-av-api-backend-prod]
module.env.google_compute_global_forwarding_rule.web_https: Refreshing state... [id=projects/pocket-av/global/forwardingRules/pocket-av-web-https-fwd-prod]
module.env.google_compute_url_map.api: Refreshing state... [id=projects/pocket-av/global/urlMaps/pocket-av-api-prod]
module.env.google_compute_target_https_proxy.api: Refreshing state... [id=projects/pocket-av/global/targetHttpsProxies/pocket-av-api-https-prod]
module.env.google_compute_global_forwarding_rule.api_https: Refreshing state... [id=projects/pocket-av/global/forwardingRules/pocket-av-api-https-fwd-prod]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.env.google_cloud_run_v2_service.keycache_server will be updated in-place
  ~ resource "google_cloud_run_v2_service" "keycache_server" {
      - client                  = "gcloud" -> null
      - client_version          = "558.0.0" -> null
        id                      = "projects/pocket-av/locations/us-central1/services/keycache-server-prod"
        name                    = "keycache-server-prod"
        # (31 unchanged attributes hidden)

      ~ template {
            # (10 unchanged attributes hidden)

          ~ containers {
                name           = null
                # (7 unchanged attributes hidden)

              + env {
                  + name  = "OIDC_CLIENT_ID"
                    # (1 unchanged attribute hidden)
                }
              + env {
                  + name  = "ZITADEL_ISSUER"
                  + value = "https://auth.pocket-rad.io"
                }

                # (9 unchanged blocks hidden)
            }

            # (2 unchanged blocks hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.env.google_cloud_run_v2_service.zitadel will be created
  + resource "google_cloud_run_v2_service" "zitadel" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + delete_time             = (known after apply)
      + deletion_protection     = false
      + effective_annotations   = (known after apply)
      + effective_labels        = {
          + "goog-terraform-provisioned" = "true"
        }
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = "INGRESS_TRAFFIC_ALL"
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "us-central1"
      + name                    = "zitadel-prod"
      + observed_generation     = (known after apply)
      + project                 = "pocket-av"
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = {
          + "goog-terraform-provisioned" = "true"
        }
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)
      + urls                    = (known after apply)

      + scaling {}

      + template {
          + max_instance_request_concurrency = (known after apply)
          + service_account                  = "zitadel-prod@pocket-av.iam.gserviceaccount.com"
          + timeout                          = "300s"

          + containers {
              + args       = [
                  + "start-from-init",
                  + "--masterkeyFromEnv",
                ]
              + build_info = (known after apply)
              + image      = "us-central1-docker.pkg.dev/pocket-av/ghcr-remote/zitadel/zitadel:v2.71.4"

              + env {
                  + name  = "ZITADEL_DATABASE_POSTGRES_ADMIN_PASSWORD"
                    # (1 unchanged attribute hidden)

                  + value_source {
                      + secret_key_ref {
                          + secret  = "zitadel-db-password-prod"
                          + version = "latest"
                        }
                    }
                }
              + env {
                  + name  = "ZITADEL_DATABASE_POSTGRES_ADMIN_SSL_MODE"
                  + value = "disable"
                }
              + env {
                  + name  = "ZITADEL_DATABASE_POSTGRES_ADMIN_USERNAME"
                  + value = "zitadel"
                }
              + env {
                  + name  = "ZITADEL_DATABASE_POSTGRES_DATABASE"
                  + value = "zitadel"
                }
              + env {
                  + name  = "ZITADEL_DATABASE_POSTGRES_HOST"
                  + value = "10.55.0.3"
                }
              + env {
                  + name  = "ZITADEL_DATABASE_POSTGRES_PORT"
                  + value = "5432"
                }
              + env {
                  + name  = "ZITADEL_DATABASE_POSTGRES_USER_PASSWORD"
                    # (1 unchanged attribute hidden)

                  + value_source {
                      + secret_key_ref {
                          + secret  = "zitadel-db-password-prod"
                          + version = "latest"
                        }
                    }
                }
              + env {
                  + name  = "ZITADEL_DATABASE_POSTGRES_USER_SSL_MODE"
                  + value = "disable"
                }
              + env {
                  + name  = "ZITADEL_DATABASE_POSTGRES_USER_USERNAME"
                  + value = "zitadel"
                }
              + env {
                  + name  = "ZITADEL_EXTERNALDOMAIN"
                  + value = "auth.pocket-rad.io"
                }
              + env {
                  + name  = "ZITADEL_EXTERNALPORT"
                  + value = "443"
                }
              + env {
                  + name  = "ZITADEL_EXTERNALSECURE"
                  + value = "true"
                }
              + env {
                  + name  = "ZITADEL_FIRSTINSTANCE_ORG_HUMAN_PASSWORD"
                    # (1 unchanged attribute hidden)

                  + value_source {
                      + secret_key_ref {
                          + secret  = "zitadel-admin-password-prod"
                          + version = "latest"
                        }
                    }
                }
              + env {
                  + name  = "ZITADEL_FIRSTINSTANCE_ORG_HUMAN_USERNAME"
                  + value = "admin"
                }
              + env {
                  + name  = "ZITADEL_MASTERKEY"
                    # (1 unchanged attribute hidden)

                  + value_source {
                      + secret_key_ref {
                          + secret  = "zitadel-master-key-prod"
                          + version = "latest"
                        }
                    }
                }
              + env {
                  + name  = "ZITADEL_PORT"
                  + value = "8080"
                }
              + env {
                  + name  = "ZITADEL_TLS_ENABLED"
                  + value = "false"
                }

              + ports {
                  + container_port = 8080
                  + name           = (known after apply)
                }

              + resources {
                  + limits = {
                      + "cpu"    = "2"
                      + "memory" = "1Gi"
                    }
                }

              + startup_probe {
                  + failure_threshold     = 30
                  + initial_delay_seconds = 10
                  + period_seconds        = 10
                  + timeout_seconds       = 5

                  + http_get {
                      + path = "/debug/healthz"
                      + port = 8080
                    }
                }
            }

          + scaling {
              + max_instance_count = 2
              + min_instance_count = 1
            }

          + vpc_access {
              + connector = "projects/pocket-av/locations/us-central1/connectors/run-connector-prod"
              + egress    = "PRIVATE_RANGES_ONLY"
            }
        }

      + traffic (known after apply)
    }

  # module.env.google_cloud_run_v2_service_iam_member.zitadel_public will be created
  + resource "google_cloud_run_v2_service_iam_member" "zitadel_public" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "us-central1"
      + member   = "allUsers"
      + name     = "zitadel-prod"
      + project  = "pocket-av"
      + role     = "roles/run.invoker"
    }

  # module.env.google_compute_backend_service.auth will be created
  + resource "google_compute_backend_service" "auth" {
      + connection_draining_timeout_sec = 300
      + creation_timestamp              = (known after apply)
      + fingerprint                     = (known after apply)
      + generated_id                    = (known after apply)
      + id                              = (known after apply)
      + load_balancing_scheme           = "EXTERNAL"
      + name                            = "pocket-av-auth-backend-prod"
      + port_name                       = (known after apply)
      + project                         = "pocket-av"
      + protocol                        = "HTTPS"
      + self_link                       = (known after apply)
      + session_affinity                = (known after apply)
      + timeout_sec                     = 30

      + backend {
          + balancing_mode               = "UTILIZATION"
          + capacity_scaler              = 1
          + group                        = (known after apply)
          + max_connections              = (known after apply)
          + max_connections_per_endpoint = (known after apply)
          + max_connections_per_instance = (known after apply)
          + max_rate                     = (known after apply)
          + max_rate_per_endpoint        = (known after apply)
          + max_rate_per_instance        = (known after apply)
          + max_utilization              = (known after apply)
            # (2 unchanged attributes hidden)
        }

      + cdn_policy (known after apply)

      + iap (known after apply)

      + log_config (known after apply)
    }

  # module.env.google_compute_global_address.auth_ipv4 will be created
  + resource "google_compute_global_address" "auth_ipv4" {
      + address            = (known after apply)
      + creation_timestamp = (known after apply)
      + effective_labels   = {
          + "goog-terraform-provisioned" = "true"
        }
      + id                 = (known after apply)
      + label_fingerprint  = (known after apply)
      + name               = "pocket-av-auth-ip-prod"
      + prefix_length      = (known after apply)
      + project            = "pocket-av"
      + self_link          = (known after apply)
      + terraform_labels   = {
          + "goog-terraform-provisioned" = "true"
        }
    }

  # module.env.google_compute_global_forwarding_rule.auth_http will be created
  + resource "google_compute_global_forwarding_rule" "auth_http" {
      + base_forwarding_rule  = (known after apply)
      + effective_labels      = (known after apply)
      + forwarding_rule_id    = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + ip_protocol           = (known after apply)
      + label_fingerprint     = (known after apply)
      + load_balancing_scheme = "EXTERNAL"
      + name                  = "pocket-av-auth-http-fwd-prod"
      + network               = (known after apply)
      + network_tier          = (known after apply)
      + port_range            = "80"
      + project               = "pocket-av"
      + psc_connection_id     = (known after apply)
      + psc_connection_status = (known after apply)
      + self_link             = (known after apply)
      + subnetwork            = (known after apply)
      + target                = (known after apply)
      + terraform_labels      = (known after apply)

      + service_directory_registrations (known after apply)
    }

  # module.env.google_compute_global_forwarding_rule.auth_https will be created
  + resource "google_compute_global_forwarding_rule" "auth_https" {
      + base_forwarding_rule  = (known after apply)
      + effective_labels      = (known after apply)
      + forwarding_rule_id    = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + ip_protocol           = (known after apply)
      + label_fingerprint     = (known after apply)
      + load_balancing_scheme = "EXTERNAL"
      + name                  = "pocket-av-auth-https-fwd-prod"
      + network               = (known after apply)
      + network_tier          = (known after apply)
      + port_range            = "443"
      + project               = "pocket-av"
      + psc_connection_id     = (known after apply)
      + psc_connection_status = (known after apply)
      + self_link             = (known after apply)
      + subnetwork            = (known after apply)
      + target                = (known after apply)
      + terraform_labels      = (known after apply)

      + service_directory_registrations (known after apply)
    }

  # module.env.google_compute_managed_ssl_certificate.auth will be created
  + resource "google_compute_managed_ssl_certificate" "auth" {
      + certificate_id            = (known after apply)
      + creation_timestamp        = (known after apply)
      + expire_time               = (known after apply)
      + id                        = (known after apply)
      + name                      = "pocket-av-auth-cert-prod"
      + project                   = "pocket-av"
      + self_link                 = (known after apply)
      + subject_alternative_names = (known after apply)
      + type                      = "MANAGED"

      + managed {
          + domains = [
              + "auth.pocket-rad.io",
            ]
        }
    }

  # module.env.google_compute_region_network_endpoint_group.auth_neg will be created
  + resource "google_compute_region_network_endpoint_group" "auth_neg" {
      + id                    = (known after apply)
      + name                  = "pocket-av-auth-neg-prod"
      + network_endpoint_type = "SERVERLESS"
      + project               = "pocket-av"
      + region                = "us-central1"
      + self_link             = (known after apply)

      + cloud_run {
          + service = "zitadel-prod"
        }

      + psc_data (known after apply)
    }

  # module.env.google_compute_target_http_proxy.auth will be created
  + resource "google_compute_target_http_proxy" "auth" {
      + creation_timestamp = (known after apply)
      + fingerprint        = (known after apply)
      + id                 = (known after apply)
      + name               = "pocket-av-auth-http-prod"
      + project            = "pocket-av"
      + proxy_bind         = (known after apply)
      + proxy_id           = (known after apply)
      + self_link          = (known after apply)
      + url_map            = (known after apply)
    }

  # module.env.google_compute_target_https_proxy.auth will be created
  + resource "google_compute_target_https_proxy" "auth" {
      + creation_timestamp = (known after apply)
      + fingerprint        = (known after apply)
      + id                 = (known after apply)
      + name               = "pocket-av-auth-https-prod"
      + project            = "pocket-av"
      + proxy_bind         = (known after apply)
      + proxy_id           = (known after apply)
      + quic_override      = "NONE"
      + self_link          = (known after apply)
      + ssl_certificates   = (known after apply)
      + tls_early_data     = (known after apply)
      + url_map            = (known after apply)
    }

  # module.env.google_compute_url_map.auth will be created
  + resource "google_compute_url_map" "auth" {
      + creation_timestamp = (known after apply)
      + default_service    = (known after apply)
      + fingerprint        = (known after apply)
      + id                 = (known after apply)
      + map_id             = (known after apply)
      + name               = "pocket-av-auth-prod"
      + project            = "pocket-av"
      + self_link          = (known after apply)
    }

  # module.env.google_compute_url_map.auth_http_redirect will be created
  + resource "google_compute_url_map" "auth_http_redirect" {
      + creation_timestamp = (known after apply)
      + fingerprint        = (known after apply)
      + id                 = (known after apply)
      + map_id             = (known after apply)
      + name               = "pocket-av-auth-http-redirect-prod"
      + project            = "pocket-av"
      + self_link          = (known after apply)

      + default_url_redirect {
          + https_redirect         = true
          + redirect_response_code = "MOVED_PERMANENTLY_DEFAULT"
          + strip_query            = false
        }
    }

  # module.env.google_dns_record_set.auth_a will be created
  + resource "google_dns_record_set" "auth_a" {
      + id           = (known after apply)
      + managed_zone = "pocket-rad-io"
      + name         = "auth.pocket-rad.io."
      + project      = "pocket-av"
      + rrdatas      = (known after apply)
      + ttl          = 300
      + type         = "A"
    }

  # module.env.google_project_iam_member.zitadel_secret_accessor will be created
  + resource "google_project_iam_member" "zitadel_secret_accessor" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:zitadel-prod@pocket-av.iam.gserviceaccount.com"
      + project = "pocket-av"
      + role    = "roles/secretmanager.secretAccessor"
    }

  # module.env.google_secret_manager_secret.zitadel_admin_password will be created
  + resource "google_secret_manager_secret" "zitadel_admin_password" {
      + create_time           = (known after apply)
      + deletion_protection   = false
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "goog-terraform-provisioned" = "true"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "pocket-av"
      + secret_id             = "zitadel-admin-password-prod"
      + terraform_labels      = {
          + "goog-terraform-provisioned" = "true"
        }

      + replication {
          + auto {
            }
        }
    }

  # module.env.google_secret_manager_secret.zitadel_db_password will be created
  + resource "google_secret_manager_secret" "zitadel_db_password" {
      + create_time           = (known after apply)
      + deletion_protection   = false
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "goog-terraform-provisioned" = "true"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "pocket-av"
      + secret_id             = "zitadel-db-password-prod"
      + terraform_labels      = {
          + "goog-terraform-provisioned" = "true"
        }

      + replication {
          + auto {
            }
        }
    }

  # module.env.google_secret_manager_secret.zitadel_master_key will be created
  + resource "google_secret_manager_secret" "zitadel_master_key" {
      + create_time           = (known after apply)
      + deletion_protection   = false
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "goog-terraform-provisioned" = "true"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "pocket-av"
      + secret_id             = "zitadel-master-key-prod"
      + terraform_labels      = {
          + "goog-terraform-provisioned" = "true"
        }

      + replication {
          + auto {
            }
        }
    }

  # module.env.google_secret_manager_secret_version.zitadel_admin_password will be created
  + resource "google_secret_manager_secret_version" "zitadel_admin_password" {
      + create_time            = (known after apply)
      + deletion_policy        = "DELETE"
      + destroy_time           = (known after apply)
      + enabled                = true
      + id                     = (known after apply)
      + is_secret_data_base64  = false
      + name                   = (known after apply)
      + secret                 = (known after apply)
      + secret_data            = (sensitive value)
      + secret_data_wo         = (write-only attribute)
      + secret_data_wo_version = 0
      + version                = (known after apply)
    }

  # module.env.google_secret_manager_secret_version.zitadel_db_password will be created
  + resource "google_secret_manager_secret_version" "zitadel_db_password" {
      + create_time            = (known after apply)
      + deletion_policy        = "DELETE"
      + destroy_time           = (known after apply)
      + enabled                = true
      + id                     = (known after apply)
      + is_secret_data_base64  = false
      + name                   = (known after apply)
      + secret                 = (known after apply)
      + secret_data            = (sensitive value)
      + secret_data_wo         = (write-only attribute)
      + secret_data_wo_version = 0
      + version                = (known after apply)
    }

  # module.env.google_secret_manager_secret_version.zitadel_master_key will be created
  + resource "google_secret_manager_secret_version" "zitadel_master_key" {
      + create_time            = (known after apply)
      + deletion_policy        = "DELETE"
      + destroy_time           = (known after apply)
      + enabled                = true
      + id                     = (known after apply)
      + is_secret_data_base64  = false
      + name                   = (known after apply)
      + secret                 = (known after apply)
      + secret_data            = (sensitive value)
      + secret_data_wo         = (write-only attribute)
      + secret_data_wo_version = 0
      + version                = (known after apply)
    }

  # module.env.google_service_account.zitadel will be created
  + resource "google_service_account" "zitadel" {
      + account_id   = "zitadel-prod"
      + disabled     = false
      + display_name = "ZITADEL (prod)"
      + email        = "zitadel-prod@pocket-av.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:zitadel-prod@pocket-av.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "pocket-av"
      + unique_id    = (known after apply)
    }

  # module.env.google_sql_database.zitadel will be created
  + resource "google_sql_database" "zitadel" {
      + charset         = (known after apply)
      + collation       = (known after apply)
      + deletion_policy = "DELETE"
      + id              = (known after apply)
      + instance        = "pocket-av-db-prod"
      + name            = "zitadel"
      + project         = "pocket-av"
      + self_link       = (known after apply)
    }

  # module.env.google_sql_user.zitadel will be created
  + resource "google_sql_user" "zitadel" {
      + host                    = (known after apply)
      + id                      = (known after apply)
      + instance                = "pocket-av-db-prod"
      + name                    = "zitadel"
      + password                = (sensitive value)
      + password_wo             = (write-only attribute)
      + project                 = "pocket-av"
      + sql_server_user_details = (known after apply)
    }

  # module.env.random_password.zitadel_admin_password will be created
  + resource "random_password" "zitadel_admin_password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 32
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "!@#$%&*"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.env.random_password.zitadel_db_password will be created
  + resource "random_password" "zitadel_db_password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.env.random_password.zitadel_master_key will be created
  + resource "random_password" "zitadel_master_key" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

Plan: 26 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>